import logging

text = """

借 款 合 同
 
合同编号：HJ-JK-657362554267697152
签署时间：2019年12月19日
贷款人（甲方）
广州惠金小额贷款有限公司 法定代表人：吴庄
证照类型：营业执照 证照号码： 91440101MA59G7X78Y
借款人（乙方）
在北京融联世纪信息技术有限公司的用户名称：
叶云海
13878992565
证件类型：身份证 证件号码：450521199405063637
联系地址：广西壮族自治区北海市合浦县石康镇石头
联系电话：13878992565
坪村
 
根据《中华人民共和国合同法》及相关法律法规 、司法解释等的相关规定，经北京融联世纪信息技术有限公
司推荐，甲乙双方平等协商一致签订本合同，以明确各方权利和义务。
 
第一条 借款用途
 
乙方向甲方借款，用于经营。未经甲方书面同意，乙方不得改变借款用途。乙方使用本合同项下贷款时，应
保留相应的贷款用途证明凭据（包括但不限于发票、收据、购物凭证等），在甲方要求提供时，乙方应当提供。
 
第二条 借款金额与期限
 
借款金额为 ¥7000.00元（大写：人民币柒仟元整）。
 
 
 
借款期限12个月（ / 日），自2019年12月19日起至2020年12月19日止。
 
若为分笔发放的，分笔发放的单笔借款金额和期限如下：
 
借款金额（人民币/万元） 发放日期 借款期限
/ / /
 
实际借款期限、借款金额、发放日期以放款电子凭证记载为准。放款电子凭证为本合同组成部分，与本合同
具有同等法律效力。
 
第三条 贷款利率
 
甲方发放给乙方的贷款，利率按以下第 (一) 种方式确定：
 
（一）执行固定年利率14.50%。月利率=年利率/12。
第 1 页 /共 11 页（二）其他方式： / 。
 
在约定的借款期限内，需要调整借款利率或计息方式的，必须由甲、乙双方协商确定。
 
第四条 贷款发放
 
一、满足下列条件时，甲方始向乙方发放贷款：
 
（一）乙方根据甲方要求签署所有必要文书，提供必要证照、证明、单据等文件、资料，并完成相关手续
，且前述文件、资料及相关手续持续合法有效；
 
（二）乙方通过了甲方合作机构和甲方的贷款审核；
 
（三）乙方签署授权委托书授权甲方使用电子签章签署本合同，本合同已经有效签署；
 
（四）乙方未出现任何影响或可能影响乙方偿付能力的重大不利情形，未出现任何违反本合同约定的情形。
 
二、甲方将贷款划入乙方指定的以下账户：
 
户 名：叶云海
 
账 号：6228481238817406270
 
开户机构：中国农业银行
 
三、甲方在发放贷款前，发现乙方提供虚假信息与资料、签章不真实，或者有其他足以危及贷款安全的重大
情形的，有权停止发放贷款，并有权单方解除或终止本合同。
 
第五条 还款与利息支付方式
 
一、结息时间与方式与采用以下第 （二） 种：
 
（一）按月结息，结息日为每月 / 日；
 
（二）按月结息，贷款发放日对应的每月相同时间（如贷款发放日在当月无对应日，则结息日为当月最后一
日）；
 
（三）按季结息，结息日为每季末月的 / 日；
 
（四）利随本清，利息于借款全部到期日一次付清；
 
（五）其他方式， / 。
 
结息日遇法定节假日或公休日不递延，乙方仍应按照本合同的约定，在结息日当日23:59:59前还款。
 
二、还本付息采用下列第 （四） 种方式：
 
第 2 页 /共 11 页（一）按月付息到期还本：按月付息到期一次性还本；
 
（二）按季付息到期还本：按季付息到期一次性还本；
 
（三）到期一次性还本付息：在贷款到期日一次性还本付息；
 
（四）等额本息：每次偿还的本息金额相同，其中每次偿还的本金逐次增加、利息逐次减少；
 
（五）等额本金：每次偿还的本息金额逐次减少，其中每次偿还的本金相同、利息逐次减少；
 
（六）等额还息，分期还本，每次偿还的本金相同，利息也相同，具体以还款计划为准；
 
（七）其他方式， / 。
 
甲乙双方按照上述还本付息方式确认的还款计划表作为本合同的附件，是本合同的重要组成部分，与本合同
具有同等法律效力。乙方应严格按照还款计划表还款，若发生还款计划表计算有误情况，甲方有权修正并通知乙
方，乙方应按修正后的数额和时间还款。
 
三、乙方支付利息或归还本金时，应通过甲方合作机构（本合同项下系指北京融联世纪信息技术有限公司
）指定借款申请平台于《借款合同》附件之还款计划表约定的结息日当日23:59:59前进行还款。如因技术故障或
其它不可抗力导致乙方无法通过上述方式还款的，乙方应于结息日前主动提前联系北京融联世纪信息技术有限公
司进行处理，否则，因此造成的全部损失或责任由乙方承担。
 
甲方有权通过委托银行、第三方支付机构或其他机构代扣代收本息的方式收款，因此用于接收乙方还款的账
户可为第三方账户。甲方授权合作机构在技术故障或其它不可抗力导致的乙方无法通过指定方式还款的情况下
，委托银行、第三方支机构或其他机构代扣乙方还款，并支付给债权人。
 
乙方应于结息日当日23:59:59前将待还本息足额存入乙方指定还款账户，乙方指定还款账户为本合同第四条
第二款项下账户，乙方可对还款账户进行变更或增加，还款账户以乙方通过甲方合作机构（本合同项下系指北京
融联世纪信息技术有限公司）指定借款申请平台绑定的还款账户为准。由于账户余额不足或其他非甲方或非委托
银行、第三方支付机构或其他机构原因导致扣款失败进而造成逾期还款的，由乙方自行承担全部责任。如乙方未
在还款日成功还款，乙方不可撤销地授权甲方有权指令银行或第三方支付机构随时划扣借款人还款账户内的资金
，直至借款人偿付完毕所有本金、利息、违约金等一切借款人应付款项为止。
 
乙方不可撤销地授权甲方指令银行或第三方支付机构在借款人还款（包括但不限于正常还款、提前还款、逾
期还款、提前收贷等情形）时同时划扣担保方应当收取的担保费及服务费及第三方借款服务方应收的贷后服务费
等。
 
四、本合同项下借款利息自甲方将借款划出给借款人之日起开始计算，若为甲方分期支付，每期应还款金额
以还款计划表为准。
 
五、如乙方未按时足额还本付息的，已经偿还的全部金额优先抵充甲方实现债权的费用、其次抵充本次借款
项下相关服务方应当收取的服务费用（如有），再次抵充利息（包括罚息、利息）、余额用于偿还本金；对有2笔
第 3 页 /共 11 页（含）以上借款到期的情况下，乙方同意甲方按照借款到期顺序冲抵乙方应还款项。
 
第六条 提前还款
 
一、乙方有权提前偿还当期应还款项，乙方要求提前偿还当期款项的，乙方应当支付借款提前还款所在的还
款月对应的全部月付利息及本金。
 
二、乙方不得一次性提前偿还全部贷款本息，如乙方因自身特殊原因需要提前还款的，应当按照下述规则向
甲方支付相应的提前还款金额，具体包括：借款提前还款所在的划款月对应的全部月付利息、全部剩余本金及提
前还款手续费。
 
提前还款手续费计算方式：
 
提前还款手续费=剩余本金×【1.2】%
 
第七条 罚息
 
一、若借款人未按约定期限偿还贷款，于逾期之日，就逾期部分，按本款约定的罚息计算方式计收罚息，直
至清偿本息为止。
 
二、罚息计算方式：
 
逾期贷款罚息=逾期本金×年化【0】%×逾期天数。
 
上述公式中，逾期贷款罚息在逾期发生的当日一次性计提。
 
逾期贷款罚息单利计算，不计收复利。
 
第八条 增信措施
 
对本合同项下借款，乙方提供以下担保措施：
 
一、由 / 提供连带责任保证担保；
 
二、由 / 提供信用保证保险。
 
第九条 贷款使用监督
 
为监督乙方借款用于约定用途和确保乙方按约定期限偿还借款本息，甲方对乙方使用贷款的情况有权进行监
督，如甲方发现乙方使用贷款用于本合同约定以外的用途，有权要求乙方进行纠正或提前还款。
 
第十条 贷款续贷
 
本合同项下贷款不得展期，但乙方清偿本合同项下贷款本息后，可以向甲方申请续贷。甲方经审查同意续贷
的，双方应重新签署借款合同。
 
第 4 页 /共 11 页第十一条 宣布贷款提前到期或提前解除合同
 
乙方有下列情况之一的，甲方可随时宣布本合同项下贷款本息全部或部分提前到期，要求乙方立即偿还截至
贷款到期日乙方应付未付借款本息及全部债务，甲方亦有权随时以通知的方式解除本合同，要求乙方立即偿还截
至贷款到期日乙方应付未付借款本息及全部债务。
 
一、未按期偿还本金或未按期支付利息。
 
二、未按约定的借款用途使用借款的。
 
三、未按期向甲方清偿其他到期债务或未按期清偿其他任何金融机构或第三人到期债务的。
 
四、乙方为签订本合同向甲方提供的信息与资料有任何一项虚假的；未提供真实、完整的个人信息或不配合
甲方对相关信息进行核实的。
 
五、涉及诉讼、仲裁、刑事侦查或涉嫌刑事犯罪，作为被告、被申请人、犯罪嫌疑人或被告人的，被纳入全
国失信被执行人名单的。
 
六、签署对履行本合同项下义务的能力有重大不利影响的合同、协议或承担具有这一影响的有关义务。
 
七、甲方有合理理由认为乙方没有能力按时足额偿还借款本息的。
 
八、乙方被宣告失踪、丧失民事行为能力、被刑事监禁或乙方死亡后，无继承人、受遗赠人、监护人、财产
代管人、或虽有继承人、受遗赠人、监护人、财产代管人，但其未履行本合同的。
 
九、出现可能严重影响担保人（如有）履约能力的事由。
 
十、出现其他可能严重影响乙方还款能力的事由。
 
乙方同意，出现上述情况之一中任一情形的，即使乙方已偿还逾期部分的贷款或乙方有能力按期偿还本合同
项下的贷款本息，甲方仍有权行使本条所赋予的宣布本合同项下贷款全部、部分提前到期或依法解除本合同的权
利，乙方对甲方行使该项权利无条件予以接受。
 
第十二条 声明与承诺
 
一、乙方声明：
 
乙方作出如下声明和保证，且该声明和保证应视同在甲方每次按照本合同的约定向乙方提供贷款时，由乙方
重复做出：
 
（一）乙方为自然人，具备签订和履行本合同所需的完全民事权利能力和民事行为能力；签署和履行本合同
系基于乙方的真实意思表示，本合同已对其具有法律约束力。
 
（二）乙方同意甲方根据有关监管规定，将与本合同有关的信息和乙方其他相关信息提报送小额贷款公司的
监管部门、行业自律组织和监管信息系统，供监管部门使用和乙方授权查询使用。
第 5 页 /共 11 页（三）乙方同意甲方根据有关法律法规、监管规定，将与本合同有关的信息和乙方其他相关信息提供给中国
人民银行征信系统和其他依法设立的信用信息数据库。甲方有权为本合同订立和履行之目的，通过中国人民银行
征信系统和其他依法设立的信用信息数据库查询乙方和保证人（如有）的相关信息。
 
（四）乙方在此保证，将按照本合同约定的借款用途使用借款，并按本合同约定的还款、付息时间按期归还
借款本息；如违反本合同约定时，甲方除依法追究乙方违约责任外，有权将乙方的违约行为录入行业监管系统和
征信系统。
 
（五）乙方同意甲方有权将乙方的借款信息、还款信息、逾期信息及与本次借款有关的乙方相关信息同步提
供给甲方合作机构及担保方，以便各方能够顺利地为乙方提供借款全流程服务。
 
（六）乙方在此保证，在签署和履行本合同过程中恪守诚实守信原则，其所出具的涉及乙方以及涉及本合同
的所有文件、信息和资料均为真实、有效、完整、准确而无任何隐瞒的。
 
（七）乙方在此保证，其签署和履行本合同的行为并不违反其所应遵守的法律、法规、规章、判决、裁决及
命令，也不与其签署的任何合同、协议或承担的任何其他义务相抵触。
 
（八）乙方在此保证，在本合同签署时没有隐瞒已经发生或将要发生的任何影响或可能影响其签署或履行本
合同、或可能对其财务状况产生不利影响的诉讼案件、仲裁案件、行政程序、财产保全措施、强制执行程序或其
他不利影响的事件，乙方不属于全国失信被执行人名单；并且，乙方将在本合同履行期内继续向甲方承担上述信
息的及时披露义务。在发生前述事件时，乙方在发生之日或其知悉之日通知甲方或甲方合作机构。
 
（九）乙方在此保证，其住址、联系地址、联系电话等信息发生变更后，自该变更发生之日书面通知甲方或
甲方合作机构，否则，因此造成的损失及责任由乙方承担，此外，未书面通知的视为原地址有效。
 
（十）乙方保证其为签署、履行本合同所需的所有手续均已合法办理完毕并有效。
 
（十一）乙方保证不存在对其履约能力造成或可能造成不利影响的其他情况或事件。
 
二、乙方承诺：
 
（一）乙方按时偿还借款本息并支付相关费用，并承诺严格遵守并履行本合同项下的各项义务。
 
（二）乙方在贷款发放后因使用该贷款资金与他人发生的任何纠纷，均与甲方无关，本借款合同正常履行。
 
（三）乙方当在获悉其卷入或可能卷入任何可能对其产生不利影响的经济、民事、刑事、行政诉讼程序或类
似仲裁程序之日，或在获悉其任何重要资产涉及任何强制执行、查封、扣押、冻结、留置、监管或其他具有同等
效力的措施之日，或被列入全国失信被执行人名单的，应立即通知甲方或甲方合作机构，详细说明所构成的影响
及已采取或计划采取的补救措施，并于获悉该事件发生之日起三个工作日内将书面通知、证明和说明文件原件
（法人和其他组织须加盖公章，自然人须经签署）送达甲方或甲方合作机构。
 
（四）乙方承诺不违反本合同约定的正常偿还次序而对其他贷款予以优先清偿，且现在和将来不签署任何致
使本合同项下的贷款处于从属地位的合同。
 
第 6 页 /共 11 页（五）自本合同签署之日起，至本合同项下的债务全部清偿完毕之前，未经甲方书面同意，乙方不得：
 
（1）如乙方经营企业的，其经营企业进行清算、重整、破产、合并（被兼并）、分立、重组、解散、减资或
类似法律程序；
 
（2）出售、出租、赠与、转移或以其它任何方式处分其任何重要资产；
 
（3）如乙方经营企业的，其经营企业股权结构发生任何变更可能影响其正常经营或对其履行本合同项下还款
义务产生不利影响的；
 
（4）为第三方提供足以对其财务状况或其履行本合同项下的义务的能力产生不利影响的担保；
 
（5）签署对乙方履行本合同项下义务的能力有不利影响的合同/协议或承担具有这一影响的有关义务。
 
（六）本合同项下的担保（如有）在遇到特定情形或发生特定变化时，乙方会按照甲方的要求及时提供甲方
认可的其他担保。该特定情形或特定变化包括但不限于担保人丧失清偿能力或明确表示将不履行担保义务等。
 
（七）乙方随时通知甲方或甲方合作机构任何可能影响其履行本合同及与本合同相关的任何文件项下义务的
能力的事件。
 
第十三条 债权转让
 
甲方有权将本合同项下甲方对乙方享有的债权依法转让给第三方，无需经乙方事先同意；甲方债权转让后
，乙方需对债权受让人继续履行本合同项下其对甲方的还款付息义务。
 
如债权转让后需通知乙方的，甲方可根据本合同约定的通知与送达方式向乙方发送《债权转让通知书》，甲
方亦可以信息推送方式通知乙方，甲方向乙方发出推送信息时视为《债权转让通知书》送达。
 
本合同项下所有甲方对甲方合作机构的授权，同样适用于债权受让人（如有）。债权受让人受让本合同项下
债权，视为同意甲方在本合同项下对甲方合作机构的各项授权。
 
第十四条 甲方违约责任
 
一、满足本合同约定贷款发放条件，甲方无正当理由延期或者拒不发放贷款的，应赔偿乙方因此而发生的经
济损失（赔偿的损失限于乙方的直接损失，不包括可得利益损失及间接损失）。
 
二、乙方有权要求贷款人赔偿因其违约而给借款人造成的损失，包括相关的诉讼费、律师费、公证费、执行
费等相关费用损失。
 
第十五条 乙方违约责任
 
乙方违反本合同约定，发生借款不能及时足额偿还或乙方违反本合同第十二条声明与承诺，甲方有权采取本
条下列一种或同时采取下列数种措施（乙方出现本合同第十一条所列情形之一，甲方行使本合同第十一条约定的
合同权利时，亦可同时采取下列一种或数种措施向乙方主张权利）：
 
第 7 页 /共 11 页一、要求借款人限期纠正其违约行为；
 
二、单方面调整乙方的还款方式；
 
三、单方面调整乙方的贷款支付方式；
 
四、宣布本合同项下贷款本息全部提前到期；
 
五、宣布本合同项下的乙方已提用的贷款本息立即全部提前到期，未提用的贷款取消，并通过各种形式向乙
方追索；
 
六、要求借款人赔偿因其违约而给贷款人造成的损失，包括但不限于因实现债权而导致的诉讼费、律师费、
财产保全费、财产保全担保费、财产保全责任保险保险费、评估费、拍卖费、公证费、执行费等相关费用损失；
 
七、要求乙方另行提供经甲方认可的保证、抵押、质押或其他担保；
 
八、根据与保证人之间的相关约定追索保证人（如有）的保证责任；
 
九、根据约定就本合同及担保合同（如有）赋予强制执行效力的公证债权文书申请有管辖权的人民法院进行
强制执行。
 
十、甲方依据本合同约定单方解除本合同的，乙方同意甲方有权按照本合同约定的罚息标准要求乙方支付罚
息或赔偿相应标准的损失。
 
十一、采取法律法规允许的其他必要措施。
 
第十六条 争议解决
 
一、本合同适用中华人民共和国法律（基于本合同之目的，在此不包括香港、澳门特别行政区和台湾地区法
律），并按其解释。有关本合同的一切争议可通过友好协商解决；协商不成的，任何一方均可向债权人所在地有
管辖权的人民法院提起诉讼。如本合同债权发生转让的，借款人同意因本合同产生的一切争议，由最终的债权受
让人所在地的人民法院管辖。
 
二、在争议解决期间，若该争议不影响本合同其他条款的履行，则其他条款应继续履行。
 
第十七条 通知与送达方式
 
一、本合同双方确认与本合同相关的各类文件及/或通知、法律文书均应以书面形式做出，并可选用邮寄或电
子方式任一方式进行送达。通过邮寄方式送达的，本合同双方确认其在甲方及甲方合作机构提交的身份证记载的
地址为有效的送达地址；通过电子方式送达的，本合同双方确认其在甲方及甲方合作机构或在本合同中预留的传
真号、手机号码、电子信箱、微信号码等为有效的送达地址。上述有效的送达地址适用于一审、二审、仲裁及执
行等阶段。
 
二、本合同双方确认其在17.1条确认的送达地址适用于合同成立时起至债务全部履行完毕时止。本合同任何
第 8 页 /共 11 页一方向其他方、仲裁机构/法院向任何一方发出的任何通知、法律文书，以电子邮件或者短信、站内信、消息通知
等形式发出的，发出即视为送达。如一方需变更电子邮箱、手机号码或实际联系地址/身份证记载地址的，或确认
的手机号码出现停机、关机、故障等无法正常接收的情况或弃用、删除本合同确认的电子邮箱的，应当自变更日
起三日内或者出现异常当日通知其他方，并得到其他方确认后方生效（如争议已处于仲裁/诉讼/执行阶段的，还
需通知仲裁机构/人民法院）；否则，上述短信、电子邮件、挂号信、特快专递等发送原约定送达地址的，仍为有
效送达，由此产生的后果由变更方自行承担。
 
三、文件及/或通知递送在下列日期视为送达：
 
（1）专人递送的，以专人递送交付对方之日为有效送达；
 
（2）挂号信或特快专递（付清邮资）递送的，以实际送达之日为有效送达；
 
（3）电子方式（其中包括传真、短信、站内信、邮件及微信类即时沟通工具等）递送的，以发出之时即为有
效送达。
 
四、本合同各方有权在任何时候更改其联系信息，但应按本合同约定的送达方式在变更后三个工作日内向甲
方及甲方合作机构送达变更通知。否则变更方应当承担由此造成的送达不能产生的法律风险及责任。如提供的法
律文书送达地址不准确、地址变更后未及时通知、或拒不接收的，按下列方式处理：1、邮寄送达的，邮件回执上
注明的返回之日视为送达之日；2、直接送达的，当场在送达回证上证明情况之日视为送达之日。
 
第十八条 权利保留
 
一、一方若未行使本合同项下部分或全部权利，或未要求另一方履行、承担部分或全部义务、责任，并不构
成该方对该权利的放弃或对该义务、责任的豁免。
 
二、一方对另一方的任何宽容、展期或者延缓行使本合同项下的权利，均不影响其根据本合同及法律、法规
而享有的任何权利，亦不视为其对该权利的放弃。
 
第十九条 文本及生效
 
本合同涉及的其他合同与协议均为本合同附件，为本合同的组成部分，与本合同具有同等法律效力。
 
本合同采用电子文本形式制成，通过甲方合作的第三方专业服务机构颁发数字证书，加盖电子签章和时间戳
，并在该机构及其公证处保留存档及证据链，双方均认可该形式协议的法律效力。借款人通过点击接受《授权委
托书》授权甲方电子签章的使用。本合同加盖借款人电子签章即表明借款人已阅读本合同所有条款，并对本合同
条款的含义及相应的法律后果已全部通晓并充分理解，同意接受本合同约束。本合同经加盖双方电子章且贷款发
放至乙方银行账户后成立生效。
 
（以下无正文）
 
 
 
 
第 9 页 /共 11 页 
 
 
贷款人（甲方）：广州惠金小额贷款有限公司
 
 
 
 
借款人（乙方）：叶云海
 
第 10 页 /共 11 页《借款合同》附件之还款计划表
 
还款计划表
 
贷款人（甲方）：广州惠金小额贷款有限公司
 
借款人（乙方）：叶云海
 
借款人在北京融联世纪信息技术有限公司的用户名称：13878992565
 
合同编号：HJ-JK-657362554267697152
 
序号 还款日/结息日 应还本金（元） 应还利息（元） 当期应还本息（元）
1 2020-01-19 545.57 84.59 630.16
2 2020-02-19 552.17 77.99 630.16
3 2020-03-19 558.84 71.32 630.16
4 2020-04-19 565.59 64.57 630.16
5 2020-05-19 572.43 57.73 630.16
6 2020-06-19 579.34 50.82 630.16
7 2020-07-19 586.34 43.82 630.16
8 2020-08-19 593.43 36.73 630.16
9 2020-09-19 600.60 29.56 630.16
10 2020-10-19 607.86 22.30 630.16
11 2020-11-19 615.20 14.96 630.16
12 2020-12-19 622.63 7.50 630.13
总计 —— 7000.00 561.89 7561.89
 
本还款计划表为借款合同的附件，是借款合同的重要组成部分，与借款合同具有同等法律效力。甲乙双方同
意乙方按照上述还款计划表所载日期和金额还本付息。乙方应严格按照还款计划表还款，若发生还款计划表计算
有误情况，甲方有权修正并通知乙方，乙方应按修正后的数额和时间还款。
 
第 11 页 /共 11 页

"""

import re
re.compile('(.*?)合同编号.*?签署时间')

re.findall('(.*?)合同编号.*?签署时间', text.replace("\n", "").replace(" ", ""))

# a = re.compile("借(.*?)同", text)
# print(a)
#
# x = []
# x.append([i.strip() for i in re.findall("^借.*?", text)])
# print(x)
import operator

# 初始化变量
a = 4

b = 3

# 使用 add() 让两个值相加
print("add() 运算结果 :", end="")
print(operator.add(a, b))

# 使用 sub() 让两个值相减
print("sub() 运算结果 :", end="")
print(operator.sub(a, b))

# 使用 mul() 让两个值相乘
print("mul() 运算结果 :", end="")
print(operator.mul(a, b))