txt = '''


“生态场景类”个人消费借款电子合同



产品名称：“生态场景类”个人消费贷款

借款合同编号：553954094822209726



特别提醒：

在您（以下亦称“借款人”）确认同意本合同之前，应已清楚知悉并充分理解本合同以及沈阳农村商业银行股份有限
公司（简称“我行”或“贷款人”）为您所提供的本合同项下的人民币信贷服务。

为了保障您的合法权益，请您仔细阅读本合同所有条款。对于限制或者免除责任的条款，在本合同中将以加黑加粗
字体显示，以便您充分理解。如果您不同意或者不理解本合同的部分或全部内容，请立即停止使用本合同项下服务并
可通过客服电话024-31281553与我们进行联系咨询。一旦您勾选或点击确认或以手写电子签名方式签订本合同，即
意味着您已阅读本合同所有条款（包括附件），并对本合同条款的法律含义及各方权利和义务有准确无误的理解，同
意接受本合同（包括附件）约束，且同意不可撤销授权贷款人委托的第三方生成并调用您的CA证书（即电子签章）用
以签署本合同及相关文件。您已知晓任何欺诈、违约行为将要承担的相应法律后果。您将本着诚实信用的原则，善意
签署并依约履行本合同。

您在贷款人或第三方合作机构相关业务平台注册的账号和密码是我行识别您的身份及指令的唯一标志，所有使用您账
号和密码的操作均视为您的操作行为,您应妥善保管您的账号及密码，防止账号及密码泄露，因账号及密码泄露所造成
的损失由您自行承担。



第一条定义与解释

除另有约定外，本合同中所涉及的部分名词解释如下：

1.1贷款人：指沈阳农村商业银行股份有限公司。

1.2业务平台：指借款人向贷款人提出贷款申请、查看贷款额度等操作的贷款人或第三方合作机构的APP应用、微信
公众号、H5链接、网站或其他与本贷款相关的软件服务端。

1.3结算账户:作为借款人的借款发放及还款账户，借款人授权贷款人从该账户中扣收借款人到期应付的本息和实现债
权的费用等。

1.4代扣还款:指为偿还本合同项下贷款本息及其他应付款项的目的，借款人无条件不可撤销地同意并授权贷款人代借
款人持续向还款账户开户行或经借款人签署《委托扣款授权书》的有权第三方支付机构组织发送代扣指令，直接将借
款人还款账户的款项划扣至贷款人账户，用于偿还借款人在贷款人处全部债务直至清偿完毕。借款人承诺前述交易委
托指令视同借款人本人作出。代扣时间、金额等指令以贷款人通知为准。

1.5还款日：指贷款人向借款人发放某笔贷款后借款人应按期归还贷款本息及其他应付款项的日期。

1.6受托支付：指贷款人根据借款人的支付委托，将贷款资金支付给符合合同约定用途的借款人的交易对象的支付方
式。

1.7自主支付：指贷款人根据借款人的申请将贷款资金直接发放至借款人的账户，并由借款人自主支付给符合本合同
约定用途的借款人的交易对象的支付方式。

1.8逾期：指借款人未按约定的还款日向贷款人足额偿还已到期贷款本息及其他应付款项。

1.9实现债权的费用：包括但不限于诉讼/仲裁费用、律师代理费用、调查取证费用、公证费用、送达费用、公告费用
、财产保全费用、执行费用、评估费用、鉴定费用、拍卖费用、差旅费用等其他为实现债权而支出的合理费用。

1.10法律法规：包括中华人民共和国的法律、行政法规、最高人民法院的司法解释以及金融监管机构的规章、规定与
命令、通知等。

1.11本合同：包括贷款人与借款人签署的本《“生态场景类”个人消费借款电子合同》及其附件（如有）,亦包括后续
对该合同及附件的任何有效修订和补充。

1.12年、月、日：除非在本合同文义中有明确的其他含义，“年”“月”均指按照公历计算的自然年、自然月,“日
”为业务平台日终轧账（指核算查对账目）时点进行切分的时间区间。



第二条基本信息

2.1借款人基本信息。为了保护借款人的个人信息，本合同在展示时，部分隐藏了借款人的身份信息和收款账户信息
。借款人知晓且承诺本合同对借款人个人信息的部分隐藏不影响本合同的效力。



2.1.1借款人：何研雅

2.1.2身份证号码：110104199509013021

2.1.3手机号码：18210630301

2.1.4微信号：

2.1.5电子邮箱：851386181@qq.com

2.1.6通讯地址：北京市北京市海淀区铁医路1号3号楼5门302号

2.1.7合同签订日期：2022年12月16日



2.2借款基本信息

2.2.1借款金额。人民币1100元（小写），大写金额壹仟壹佰元整（大小写不一致时，以大写为准）

2.2.2借款期限。12个月，自2022年12月16日起至2023年12月16日止。

2.2.3贷款执行年利率：7.5%

2.2.4借款用途：其他日常消费

2.2.5收款账号：6212260200037887714

2.2.6还款方式：等额本息

2.2.7还款账号：6212260200037887714

2.3保证人及保证合同基本信息。

2.3.1保证方式为连带保证责任担保

2.3.2保证人：广西恒润融资担保有限公司

2.3.3保证合同名称：单笔保证合同

2.3.4保证合同编号：553954094822209726

2.4出质人及质押合同基本信息。

2.4.1质押方式为保证金质押

2.4.2出质人：广西恒润融资担保有限公司

2.4.3质押合同名称：保证金最高额质押合同

2.4.4质押合同编号：SYRCB-YX-20220914-01



第三条借款用途的限制

3.1未经贷款人书面同意，借款人不得擅自改变本合同中的借款用途。

3.2贷款人有权通过账户分析、凭证查验、现场调查等方式核查借款人的贷款使用是否符合本合同约定用途。乙方使
用本合同项下贷款时，应保留相应凭据（包括但不限于发票、收据、凭证等），在甲方要求提供时，乙方应当提供。
借款人承诺合规合法使用借款额度项下取得的贷款资金，相关借款用途不包括购买房屋、进入证券市场、用于股本权
益性投资、相关经营性用途，以及法律法规禁止或限制的其他用途，否则引起的一切后果由借款人自行承担。



第四条贷款利率及计结息

4.1贷款利率属性。本合同项下相关贷款利率按照单利计算，该利率为固定利率，贷款发放后遇贷款市场报价利率调
整不发生变动。

4.2罚息

4.2.1本合同项下贷款逾期的，逾期罚息利率为贷款合同利率水平上加收50%。

4.2.2若借款人未按本合同约定用途使用贷款的，挪用罚息利率为合同利率水平上加收100%。

4.3计息、结息和付息

4.3.1贷款利息自贷款发放日起开始计算，按日计息。计算公式为：贷款利息=当前未归还本金*日利率*资金占用天数
，月利率=年利率/12，日利率=年利率/360。如国家变更利率确定方式、调整方式和计息方式的，按国家有关规定执行
，贷款人将不再另行通知借款人。

4.3.2如借款人未按约定的还款日向贷款人足额偿还已到期款项的（包括贷款人宣布贷款部分或全部提前到期的），贷
款人有权从逾期之日起，按实际逾期天数对逾期借款本金按合同约定的逾期罚息利率计收罚息，对借款人未按时支付
的利息，以未按时支付的利息作为基数并按逾期罚息利率标准计收复利，直至本息清偿为止，相关复利可由贷款人手
工计算后向借款人主张和收取。

4.3.3如借款人未按本合同约定用途使用贷款的，贷款人有权自贷款被挪用之日起，对挪用部分按本合同约定的挪用罚
息利率计收罚息，贷款被挪用期间未按时支付的利息，以未按时支付的利息作为基数并按挪用罚息利率标准计收复利
，直至本息清偿为止，相关复利可由贷款人手工计算后向借款人主张和收取。

4.3.4对于既逾期又未按本合同约定用途使用贷款的，择较重者计收罚息，不予并处。



第五条贷款发放

5.1借款人可通过与贷款人合作的第三方业务平台发起借款操作，借款人提交的借款申请经贷款人审核通过后，贷款
人将资金支付至借款人绑定/指定的账户内。

5.2支付方式及发放账户（借款人绑定/指定的收款账户）

5.2.1贷款发放日为贷款资金从贷款人账户划出之日，贷款资金一旦进入借款人绑定/指定的收款账户,即视为贷款人已
充分履行放款义务。

5.2.2贷款成功发放后，贷款人可以通过业务平台或其他渠道（包括但不限于短信、邮件、贷款人微信公众号或APP通
知）等方式向借款人发出放款通知等文件或信息。以上发放时间、发放金额等信息以本合同及其附件载明为准。

5.2.3若因各种原因导致贷款人实际发放的贷款金额大于本合同载明的贷款金额的，借款人在接到贷款人书面、电子
等方式的通知后5个工作日内应将差额资金返还给贷款人，贷款人对在上述5个工作日内返还的该等差额资金不计利息
，超过上述时限后借款人应就该等差额资金按本合同约定的贷款利率向贷款人计付利息，借款人同意贷款人可根据本
合同还款的约定发起代扣还款操作。

5.3债务证明。贷款人将按照其一贯的业务操作准则，在其会计账簿、内部数据仓库、核心系统等物理或电子载体上
保持一套与本合同及所有附属文件所涉及的业务活动相关的会计账目及凭证。除明显错误外，借款人承认该有关会计
账目和凭证的记录是借款人债务的有效证据。借款人不能仅因为会计账目及凭证由贷款人单方制作或保留，而提出异
议。



第六条支付提示

6.1本合同项下贷款支付方式为受托支付的，贷款人将根据借款人的支付委托，将贷款资金支付给符合合同约定用途
的借款人的交易对象的收款账户，仅供借款人与借款人指定的交易对象之间完成特定的交易目的，借款人对其提供的
收款账户的性质与真实性、有效性、合法性负责；本合同项下贷款支付方式为自主支付的，贷款人将对应的贷款资金
直接发放至借款人绑定/指定的收款账户，该账户应为借款人本人账户，借款人应定期报告或告知贷款人贷款资金支付
情况。
6.2无论采用受托支付还是自主支付方式，借款人应确保贷款发放账户（借款人指定的收款账户）状态正常（包括但
不限于未被有权机关冻结等）。贷款资金进入贷款发放账户后，本行即履行完成本合同义务，若贷款发放账户发生被
有权机关冻结、扣划等风险、责任及损失，均由借款人承担，借款人并不能因此主张免除还款义务。贷款人由此遭受
的一切损失，借款人应予以赔偿。

6.3无论采用受托支付还是自主支付方式，借款人应保证提供准确的收款账户信息给贷款人，若借款人提供的收款账
户信息有误、账户状态不正常、或者因借款人提供收款账户的开户银行汇款转账系统延误、故障或者因人行跨行转账
系统延误、故障等原因导致贷款人发放的贷款未能支付至借款人指定收款账户的，贷款人不承担责任，贷款利息仍然
按约定的贷款发放日起算。若因上述原因导致贷款人放款失败的，借款人需重新申请放款。若因借款人提供的收款账
户信息错误，给贷款人造成损失的，借款人应承担赔偿责任。



第七条还款

7.1还款方式内涵。本合同项下的“等额本息”还款方式，系指借款人每期以固定、等额方式归还本金和利息，每期
为一个月，最后一个月不足整月的视同为“一个月”。

7.2应还款额。对于本合同项下的贷款本金和相应利息，借款人应在贷款的还款日前归还当期应还金额。贷款人将根
据借款人的还款方式、贷款本金、还款日期、贷款期限和贷款利率等为借款人计算借款人每个还款日的应还款额。借
款人可在业务平台查询借款人每个还款日的应还款额。贷款人及其合作的第三方在每个还款日到期前可采用发送短信
、APP提醒等方式提醒借款人还款日及还款金额。

7.3还款日

7.3.1本借款合同项下的贷款每月还款日遇法定节假日不顺延，为固定日期，最后一期还款日为贷款到期日。

7.3.2每月1至28日申贷的未来还款日为次月1-28日，每月29，30，31日申贷的未来还款日为次月28日。

7.3.3如遇特殊年份、月份、日期导致上述7.3.2款约定无法有效实现变更还款日的，借款人按照贷款人设定的相关规则
执行。

7.4还款账户。还款账户须为借款人在贷款人处开立的个人结算账户,或使用其他银行金融机构的相关账户进行还款。
为及时偿还贷款相关款项，借款人应在贷款期间始终维持还款账户状态正常。

7.5正常还款

7.5.1借款人须至少在还款日前三天将足额款项存入还款账户供贷款人及/或贷款人指定的代理机构（包括相关银行及
第三方支付机构等）自动扣收，由贷款人从该账户中主动扣收到期应还贷款本息和实现债权的费用等。即使还款日为
非工作日，还款时间并不顺延，借款人应提前存入足额款项。如账户中存款不足扣收的，贷款人将按费用、违约金或
补偿金、复利、罚息、利息、本金的顺序扣收，同时对不足部分作逾期处理，并有权根据中国人民银行的有关规定对
逾期本金计收罚息，对逾期利息计收复利。借款人的还款时间以贷款人及/或贷款人指定的代理机构从借款人的还款账
户实际划扣到还款资金的时间为准，还款金额以贷款人实际收到借款人的还款金额为准。

7.5.2借款人在此不可撤销地授权贷款人及贷款人指定的代理机构（包括相关银行及第三方支付机构等）于还款日或
该日后从借款人指定的还款账户中自行代扣全部到期应付款项用于清偿借款人的到期债务，如代扣后借款人有任何异
议，由借款人和贷款人共同核实并协商解决。如因余额不足、账户状态异常等任何原因导致未能成功扣款，由此产生
的逾期后果和其他不利后果将由借款人承担。

7.5.3借款人在此不可撤销地授权，在借款人指定的且经贷款人确认的还款账户因余额不足、账户状态异常等任何原因
导致未能成功扣款的情况下，贷款人有权从借款人在贷款人及辽宁省农村信用社辖属各营业机构处开立的任何银行账
户上扣划相关存款用于清偿借款人的到期债务。上述权利的行使不依赖任何支付渠道及相关金融机构间的签约及授权
，贷款人有权选择通过相关操作系统或手工记账等方式完成，且无需提前通知借款人。

7.5.4贷款人有权根据借款人的实际情况要求借款人以除贷款人自动扣收以外的其他方式偿还本合同项下的贷款。

7.6提前还款

7.6.1若贷款人同意借款人提前归还本合同项下全部借款的，借款人可自行在业务平台上按照系统提示进行提前还款的
操作。借款人提前还款金额不得低于系统提示的最低还款额。如提前还款涉及贷款人人工审批的，提前还款的相关金
额以及具体操作按照人工审批结果为准。除以上提前还款方式外，贷款人不支持其他提前还款方式，借款人予以同意
并知悉。提前还款的限制性约定包括：提前还款金额最多不超过贷款本金余额及当期已计未结利息之和；提前还款金
额优先用于偿还本金；同一笔贷款每日只可进行一次提前还款；提前还款时的最低还款额不得低于还款计划中当期应
偿还的贷款本息。

7.6.2借款人按照上述约定进行提前还款的，对于剩余借款的还款方式及计息方式不变，借款人仍需对剩余借款按照约
定还款方式进行还款。

7.6.3若本贷款不支持提前还款方式，则本合同项下全部借款不支持提前结清或提前归还当期以外的其他期应还款项。
借款人应当按照个人借款合同中载明的贷款期限和还款日进行还款操作。

7.7逾期还款。如贷款逾期90天以内（含90天）且借款人支付的款项不足以偿还借款人欠贷款人的到期债务的，则贷款
本息及费用的偿还顺序为：实现债权的费用、违约金（如有）、复利（如有）、罚息、利息、本金。贷款逾期90天以
上且借款人支付的款项不足以偿还借款人欠贷款人的到期债务的，则贷款本息及费用的偿还顺序为：本金、实现债权
的费用、违约金（如有）、复利（如有）、罚息、利息。贷款人有权对前述还款清偿顺序作出调整。



第八条借款人承诺与保证

除在本合同其他条款中已做出的承诺与保证之外，借款人在此还向贷款人做出如下承诺与保证：

8.1借款人具有真实有效的身份证明，信用良好，有能力按期偿还贷款相关款项。

8.2借款人保证借款人具备签署和履行本合同所需的完全民事权利能力和行为能力，已充分理解本合同条款内容，签
署本合同系借款人真实意思表示。本合同构成对借款人具有约束力的协议，贷款人可以根据合同条款要求借款人履约
或对借款人执行。

8.3借款人签署和履行本合同，并不违反任何对借款人及借款人的资产有约束力的法律法规或生效的司法裁判/仲裁裁
决，不违反任何对借款人有约束力的合同、协议、约定或承诺，不侵犯任何第三方的合法权益。截至本合同签署之日
，不存在涉及借款人需承担给付义务或可能影响本合同项下贷款人权益的的任何刑事/行政/民事诉讼程序、调解程序、
仲裁程序、行政处罚程序或其他争议。

8.3借款人已在申请文件中向贷款人说明了借款人个人有关信息，并将不时按贷款人的要求对借款人资产负债情况进
行说明并提供必要文件和资料。借款人保证在申请贷款及贷款存续期间，借款人提供给贷款人的信息及文件、资料全
部是真实、完整、准确、合法、有效的，并不存在任何隐瞒、虚假、欺诈或误导。

8.4借款人保证本合同项下贷款的用途符合国家法律法规的规定并严格按照本合同约定的用途使用，不擅自改变借款
用途或将借款挪作他用；借款人保证根据贷款人的要求向贷款人提供符合本合同约定用途的相关贷款使用支付凭证
（包括但不限于合同、收据、发票、商家出具的消费清单等）。

8.5贷款存续期间内，如借款人发生经济情况恶化包括但不限于失业、单位破产或个人财产遭受重大损失、个人身体
情况发生重大不利变化、离婚、丧失民事行为能力、失踪等可能影响借款人履行本合同能力的事项，应在发生或可能
发生之日起7个工作日内书面通知贷款人，贷款人有权根据具体情况决定是否提前收回部分或全部贷款。

8.6如有任何损害或可能损害贷款人在本合同项下权益的事实发生或可能发生，借款人应尽力采取补救措施并毫不迟
延地通知贷款人。

8.7借款人确认，无论是借款人本人或是以借款人名义使用借款人的用户名和密码登陆后进行的一切活动均代表借款
人本人的意思并由借款人承担相应的法律后果。即使上述“以借款人名义使用借款人的用户名和密码登陆后进行的一
切活动”被相关司法等有权机构认定为非借款人本人意思表示，借款人承诺由此产生的不利法律后果承担全部责任
，上述责任包括但不限于过错责任或侵权责任。

8.8借款人承诺将妥善保管本人的账号、密码、绑定的手机号码、手机验证码等与办理及使用借款过程中的一切有关
信息。借款人应确保不向其他任何人泄露有关账号、密码、手机验证码等相关信息。对于因账号、密码、手机验证码
泄露所致的损失，由借款人自行承担。如借款人发现有他人冒用或盗用本人账号、密码、手机验证码或任何其他未经
借款人合法授权之情形时，应立即通知贷款人，要求其暂停相关服务。同时，借款人理解贷款人对相应的请求采取行
动需要合理期限，在贷款人对借款人相应的请求采取行动之前，针对向该账户已执行的指令及/或所导致的借款人的损
失，贷款人不承担责任。

在本合同项下全部借款到期之前，借款人变更姓名、户籍所在地、经常居住地、通讯地址、邮政编码、住宅电话、单
位电话、手机号码、邮箱地址或其他个人信息的，均须在变更完成后3个工作日内提交相关资料通知贷款人，并经贷款
人确认。逾期变更或未按本条规定履行变更通知的，导致相关通知、文件不能送达等不利后果的，由借款人自行承担
相应法律责任。

8.9借款人承诺配合贷款人进行贷款支付管理、贷后管理及相关检查，包括但不限于接受贷款人对本合同项下贷款使
用情况和借款人财务活动情况进行监督和检查，并为贷款人的前述监督和检查提供工作方便。

8.10借款人确认知晓并同意，无论任何原因造成贷款出现逾期，贷款人有权将借款人的逾期信息向征信机构以及中国
人民银行金融信用信息基础数据库（包括中国互联网金融协会等行业自律组织或其他合法有权机构）报告，由此导致
借款人个人征信受到影响的后果由借款人自行承担。借款人应当按时归还贷款本息，以免影响征信纪录。

8.11借款人如要为他人债务提供担保，应当书面通知贷款人并征得贷款人书面同意。



第九条违约事件与违约责任

9.1以下任一事件均构成本条款所称“违约事件”：

9.1.1借款人未能完全适当地履行借款人在本合同项下的任何承诺、保证、义务或责任；

9.1.2借款人没有按时足额偿还贷款的贷款本金、利息或其他应付款项的；

9.1.3借款人未按本合同约定用途使用贷款或将贷款资金用于法律法规及本合同约定的禁止领域；

9.1.4借款人使用虚假的身份、财产证明，或提供任何虚假信息获得本合同项下贷款；或者借款人隐瞒真实的重要情况
，或借款人不配合贷款人的调查、审查和检查；

9.1.5借款人违反与贷款人或其他任何第三方签订的其他合同（包括但不限于授信合同、贷款合同、抵押合同、担保合
同等）或发生其它偿债责任到期不能履行的情形，或与借款人相关的纠纷已进入诉讼/仲裁或强制执行程序，或借款人
的房屋、车辆、存款等重要财产被公检法、行政机关查封、冻结或扣押的，导致无法或可能无法按时足额偿还应还款
项的；
9.1.6借款人卷入或即将卷入重大的诉讼或仲裁程序及其他法律纠纷，经贷款人合理判断足以影响借款人的偿债能力；

9.1.7借款人转移资产以逃避债务的、借款人被采取刑事强制措施或追究刑事责任、借款人的信用状况下降的；

9.1.8借款人明确表示或以自己的行为表明借款人将不履行本合同项下的义务；

9.1.9其他经贷款人合理判断对贷款人债权产生严重不利影响的事件或行为。

9.2有违约事件发生时，贷款人有权采取包括但不限于下述措施：

9.2.1要求借款人限期纠正违约行为；

9.2.2调整、取消或者终止本合同对应的相关借款额度；

9.2.3宣布本合同项下的贷款部分或全部立即到期，要求借款人立即提前清偿部分或全部债务；

9.2.4采取公告催收、委托代理机构催收、诉讼催收等方式进行清收；

9.2.5按本合同约定计收逾期罚息利率和挪用罚息利率，直至本息清偿为止；

9.2.6要求借款人承担实现债权的费用；

9.2.7借款人有逃避贷款人监管、拖欠贷款本金及利息、恶意逃废债务等行为时，贷款人有权将该行为向借款人所在单
位及其他有关单位通报，并在媒体及网络平台上公告。

9.2.8贷款人根据法律法规规定或本合同约定有权采取的其他违约救济措施。



第十条公证

如果贷款人要求对本合同进行强制执行公证的，借款人应予以配合。借款人同意本合同经公证后具有强制执行效力。
如借款人不履行本合同项下义务的，贷款人可以依法向有管辖权的人民法院申请强制执行。



第十一条通知与送达

11.1借款人（含共同借款人，下同）确认送达人（包括贷款人、债权受让人、人民法院、仲裁机构等）可采取如下任
一方式送达本合同涉及和有关的各类通知以及因本合同发生争议时相关文件和法律文书。电子送达与书面送达具有同
等法律效力。

11.1.1当面送达；

11.1.2电话或短信送达；

11.1.3电子邮箱送达；

11.1.4邮寄送达；

11.1.5业务平台送达（包括但不限于APP、微信公众号、小程序、官方网站等方式）。

11.2借款人确认在本合同中填写的手机号码、常住地址及电子邮箱为送达地址。借款人应确保电子邮箱在本合同签订
之日已能够正常使用。因邮箱未能正常使用导致送达不能的法律后果由借款人自行承担。

11.3送达如采用亲自或委托递交的方式，则以借款人或借款人收件代理人签收之日为送达日期，当场送达拒收的以送
达人当场在送达回证上记明情况之日为送达之日；如采用快递或挂号信进行邮递的方式，则以邮件寄出之日起第三日
视为送达，因非贷款人原因导致邮件或挂号信被退回的，以文书退回之日视为送达之日；如采用短信、电子邮箱、
APP、微信公众号等方式送达的，则贷款人或争议解决机构系统记录的发出信息的时间即为送达时间。送达人采取多种
方式送达的，以其中较快到达的为准。同时借款人不可撤销的授权及同意贷款人可向相关短信发送平台公司、通信运
营商调取相关信息发送凭证。

11.4贷款人有权根据服务项目或服务内容，对服务价格、优惠措施及其生效和终止日期、与价格相关的例外条款和限
制性条款、咨询（投诉）的联系方式等信息通过贷款人网点、网站、手机银行、APP、微信公众号等渠道以公告的方式
向借款人明示。贷款人公告内容构成本协议不可分割的一部分，与本协议具有同等效力。贷款人有义务告知借款人查
询上述公告内容的途径或方法，借款人应在充分知晓、理解有关公告内容后签署本协议。

11.5上述送达地址适用范围包括各类通知、协议等文件以及就本合同发生纠纷时相关文件和法律文书的送达，同时包
括本合同因争议进入仲裁、民事诉讼程序后的各个程序。

11.6借款人应确保借款人在业务平台上提供或本合同约定的通讯地址、家庭住址、工作单位及电子邮箱地址、手机号
码、联系人及联系方式等信息完全准确、有效。借款人的信息（特别是送达地址）发生变更的或借款申请前及借款期
限内发生携号转网导致电子邮箱地址变化的，应当按本合同约定履行通知义务。如借款人未按合同约定履行通知义务
，上述所确认的送达地址仍视为有效送达地址。因借款人提供或者确认的送达地址不准确、送达地址变更后未及时依
程序告知贷款人和争议解决机构、借款人或借款人指定的接收人拒绝签收等借款人方其他原因，导致法律文书未能被
借款人实际接收的，依然产生送达的法律后果。



第十二条信息收集、使用、分享与保护

12.1收集借款人的信息

为客观、准确地评判借款人的信用情况和贷款额度，履行法律法规或监管要求贷款人应当履行的法定义务，借款人了
解并同意当借款人访问业务平台或借款人使用业务平台的服务时，借款人须向贷款人提供一些必要的信息，且借款人
同意并授权贷款人或贷款人委托的第三方为本合同之目的通过以下途径获取、核验借款人的信息，且借款人同意并授
权下述个人、企业或其他组织根据贷款人的指示提供借款人的信息：

12.1.1收集借款人留存在业务平台和贷款人合作或关联公司处与贷款相关的必要信息，如姓名、身份证号、身份证复
印件、扫描件或照片、联系电话、联系地址、资产信息、日志信息、履约信息等；

12.1.2收集借款人留存在业务平台和贷款人合作机构，如贷款服务机构、数据服务机构等处与贷款相关的必要信息
，如房产、车辆等借款人的财产信息，借款人同意并确认，借款人在将前述信息提供给贷款人或贷款人委托以及合作
的第三方之前已清楚知晓可能带来的不利后果，包括但不限于基于前述信息对借款人做出的负面评价；

12.1.3向中国人民银行金融信用信息基础数据库，资信评估机构或有关法律、监管机构许可的类似机构（以下统称
“信用服务机构”）查询、核实、打印、留存借款人的信用信息和信用报告；

12.1.4向行政机关、司法机关及公共事业单位（如人力资源和社会保障部门、公积金管理中心等）查询、打印、留存
借款人与贷款相关的必要信息，如社保信息、公积金信息、诉讼信息等；

12.1.5向合法留存借款人信息的自然人、法人以及其他组织收集借款人与贷款相关的必要信息。
12.2使用借款人的信息

为了更好地为借款人提供服务，也为了贷款人自身的信贷风险防控以及对借款人履约能力的评估，借款人同意并授权
贷款人及/或独立或共同向借款人提供服务的第三方、贷款人合作机构将借款人的信息用于如下用途：

12.2.1为保护借款人的账户及资金安全，对借款人的身份进行识别、验证等；创建数据分析模型，为借款人提供适合
于借款人的金融服务，并维护、改进这些服务；

12.2.2合理评估借款人的财务等状况，防控风险；

12.2.3为使借款人知晓贷款人的服务情况或了解贷款人的服务，通过电子邮件、业务平台站内信息、手机短信或传真
等方式向借款人发送服务状态的通知；

12.2.4因借款人与贷款人的纠纷未能够协商解决而需要通过借助催收及法律途径解决的，贷款人会将借款人的信息提
供给催收公司、律师事务所、法院、仲裁委员会和其他有权机关；

12.2.5预防或阻止非法的活动；

12.2.6经借款人许可的其他用途。

12.3分享借款人的信息

贷款人对借款人的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租借款人的任何信息，贷款人会
在下列任一情况下才将借款人的信息与第三方分享：

12.3.1某些服务和产品由贷款人和/或合作伙伴单独或共同提供（如联合贷款），贷款人会与其合作伙伴共享并使用借
款人的必要信息；借款人同意并授权贷款人可在合作伙伴平台向借款人展示相关信息并提供相应服务内容。

12.3.2为建立信用体系，借款人同意并授权贷款人及合作伙伴向中国人民银行金融信用信息基础数据库、信用服务机
构、行业自律组织或其他合法有权机构发送借款人的信息（包括不良信息）；

12.3.3当借款人违反与贷款人的约定时，为维护贷款人的合法权益，借款人同意贷款人可向合作的律师事务所、催收
公司、法院、仲裁机构、司法鉴定中心等和其他有权机关，及贷款人认为可向借款人传达信息的联系人等披露借款人
的违约信息；

12.3.4借款人同意贷款人根据有关监管及行业协会的要求，将与本合同有关的信息和借款人其他相关信息向监管部门
、行业自律组织和监管信息系统报送，供监管部门使用；

12.3.5为了更好地处理借款人的个人信息，借款人同意贷款人将借款人的个人信息提供给贷款人委托的数据服务机构
进行处理。贷款人对受托机构的资质、能力承担保证责任；

12.3.6根据法律法规的规定及有权机关的要求；

12.3.7获得借款人的同意或授权的其他情形。

12.4电子信息三方存证

鉴于本协议通过电子签约方式进行，与贷款人建立合作关系的申请贷款平台或者网站的运营主体负责电子信息的生成
、保存、出具。借款人不可撤销的授权该平台运营主体向贷款人及其认可的联系人、债权受让人、法院等机构在本合
同约定使用范围内进行提供，出示。

12.5委托处理借款人的信息

为了提升服务效率，提高服务质量，贷款人可能需要委托合作机构（以下合称“受托机构”）协助完成本合同项下的
部分服务或职责，例如：

12.5.1委托受托机构按照本合同的约定采集借款人的信息或对借款人的信息进行分析、加工和处理，用于贷款服务的
风险控制或维护、改善贷款服务；

12.5.2委托受托机构提供客户服务（如咨询等）；

12.5.3当借款人逾期或发生其他违约行为时，贷款人可委托合作机构、催收机构、律师事务所等代为催收。

为此，贷款人将在贷款服务相关的必要范围内向受托机构提供借款人的部分信息。受托机构对借款人的信息同样承担
保密义务，禁止将这些信息用于未经借款人同意的用途，因受托机构等第三方违反保密业务给借款人造成损失的，贷
款人不承担任何责任。

12.6违约失联修复

因借款人逾期还款或存在其他违约行为，贷款人委托调解机构调解或起诉或申请仲裁的，借款人不可撤销授权同意
，调解机构、人民法院或仲裁机构等在贷款人提供其手机号码仍然无法取得联系的前提下，调解机构、人民法院或仲
裁机构可依法向各通讯运营商调取其名下其他手机号码，以便取得联系。

12.7借款人的信息保护

贷款人将尽合理努力保护借款人的个人信息，采取合适的安全措施和技术手段保护借款人的个人信息，以防止丢失、
被误用、受到未授权访问或泄漏、被篡改或毁坏。



第十三条合同变更、解除和转让

13.1贷款人可在法律允许的范围内不时对本合同的内容进行修订。但相关修改不会加重借款人在贷款金额、利（费
）率和期限方面的责任。

13.2除法律法规另有强制性规定外，贷款人将就修订内容在业务平台（包括APP、网站、微信公众号等）提前公告
，公告期满即为生效，无须另行通知借款人。借款人可在公告期内自行选择是否继续使用贷款人提供的贷款服务，一
旦借款人继续使用本贷款服务即被视为借款人已接受了修改后的合同内容；如不同意有关变更，可在向贷款人全额还
清本合同项下所有应付款项后，停止使用贷款人提供的贷款服务。

13.3本合同生效后，除本合同另有约定或另行协商确认外，借款人不得要求单方变更或解除本合同。

13.4借款人未经贷款人同意，不得将本合同项下的权利义务转让给第三方；借款人确认，贷款人基于自身经营需要
，有权将其在本合同项下的权利（包括贷款债权收益权）及义务全部或部分转让给第三方，该转让行为无需另行征得
借款人同意，但贷款人转让权利时将通知借款人，通知可以书面、短信、邮件等形式通知或在业务平台或其他公开媒
体上发布公告等形式通知。合同权利义务转让后，借款人同意与债权受让人之间基于本合同权利义务转让发生的争议
解决方式适用本合同争议解决的约定。



第十四条特别约定

14.1若贷款人软（硬）件系统出现下列任一状况而无法正常运作，致使无法向借款人提供贷款相关服务的，贷款人均
不承担任何违约或赔偿责任，该状况包括但不限于：

14.1.1在贷款人信贷系统及其辅助系统、网站或业务平台维护或升级期间；

14.1.2电信设备出现故障不能进行数据传输的；

14.1.3因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成贷款人服务运行系统障碍不能执
行业务的；

14.1.4由于黑客攻击、电信部门和其他有信息技术依赖的相关部门、企事业单位技术调整或故障、网站升级方面的问
题等原因而造成的服务中断或者延迟；

14.1.5借款人操作不当或通过非贷款人授权或认可的方式使用贷款平台服务的；

14.1.6其他非贷款人原因导致的故障。

14.2借款人保证，不向其他任何人泄露在注册时向贷款人提交的电子邮箱、用户名、密码及安全问题答案等信息，上
述信息是借款人在贷款人处的唯一身份识别信息。借款人知晓应妥善保管用户名、密码及与账户有关的一切信息。如
非因贷款人原因造成借款人账户密码或相关信息泄露的，由此导致的借款人损失需由借款人自行承担。

14.3借款人理解本合同所涉服务有赖于业务平台系统的准确运行及操作。若出现业务平台系统差错、故障或其他原因
引发了展示错误、借款人或贷款人不当获利等情形的，借款人同意贷款人可以自行或通过第三方机构采取更正差错、
扣划款项、暂停服务等适当纠正措施。



第十五条合同组成

本合同由本合同条款、本合同相关附属文件、贷款人信贷系统及其辅助系统各项规则、借款人在业务平台填写的所有
信息、业务平台各项规则以及与本贷款相关的各类电子凭证等组成，各组成部分均具有法律效力，与本合同条款有冲
突的以本合同条款为准。



第十六条合同生效

借款人在业务平台勾选并点击确认同意或以手写电子签名方式签订本合同后，本合同即在借款人和贷款人之间生效。



第十七条适用法律与争议解决

17.1本合同适用中华人民共和国法律法规。

17.2本合同项下及与之有关的一切争议各方首先应协商解决；协商不成的，各方同意在贷款人住所地有管辖权的人民
法院进行诉讼；各方同意，根据管辖法院情况可采用视听传输技术等方式开庭。如发生债权一次或多次转让的，借款
人同意任何一方均可选择下列之一的人民法院起诉：

1)合同签订地；

2）原告所在地；
3）被告所在地；

4）债权人或债权受让人所在地（包括但不限于注册地、经营地、分支机构所在地、以及在各地设立的办事机构所在
地）。

17.3伴随我国互联网法院（法庭）的建设，如贷款存续期间贷款人与相关非贷款人住所地的互联网法院（法庭）建立
了线上司法合作关系，则该互联网法院（法庭）可以作为审理本合同项下相关争议的管辖法院。

17.4贷款人因本合同项下贷款所签署的其他附属协议或独立协议约定解决的管辖与本合同不一致的，以本协议约定为
准。但各方明确就专项事由（如征信、扣款）另有约定或后续其他协议明确对本合同约定管辖进行变更的除外。



第十八条其他约定

18.1本合同的任何条款或内容被依法撤销或被认定为无效时，其它条款和内容的效力不受影响，仍为有效。

18.2在贷款人的债权尚未得到全部清偿前，借款人出现逾期等任何违约行为时，贷款人在任何时间所给予的宽容、宽
限或延缓行使权利，均不损害、影响或限制贷款人应享的一切权利，亦不能解释为贷款人对任何违约行为的许可，更
不能视为贷款人放弃现在或将来对上述违约行为采取行动的权利。

18.3无论借款人的贷款是否被批准或贷款期限是否已终止，借款人同意贷款人可保留借款人的个人相关资料，贷款人
可不予退还、销毁，同时承诺履行保密义务。

18.4借款人同意贷款人对与借款人沟通的电话、语音、文字、图像、视频等进行记录，并且借款人同意将该等文字、
语音文件、图像、视频文件等用于贷款人认为合适且必要的目的，包括但不限于将其在针对借款人或任何其他人的争
议解决（如诉讼、仲裁等）中用作证据。

18.5本合同各条款的标题仅为方便查阅而设，不对合同条款的内容和解释构成任何限制和影响。

18.6借款人同意并明确知晓如因借款人逾期或存在其他违约行为，贷款人有权依法委托第三方机构依法向借款人催收
。若借款人存在违约且贷款人委托了催收机构的，合同履行地变更为催收机构住所地。

18.7各方一致同意本合同以数据电文形式订立并认同其效力，本合同数据电文生成地（指电子签章服务器所在地）为
合同签订地。



（本页以下为签署部分，无正文）



在签署本合同时，甲方就本合同项下减轻或免除甲方责任等与乙方有重大利害关系的条款以字体加粗方式向乙方进行
了合理提示，并已就该等条款及合同其他条款主动或按照乙方要求向乙方进行了详细地说明和解释，乙方对该等条款
的法律含义有准确无误的理解。双方确认对合同的全部条款均无疑义。








借款人（电子签字）pmb





贷款人（电子签章）







'''
# import re
#
# a = re.search('第十七条适用法律与争议解决.*17\.2(.*)17\.3', txt.replace("\n", "")).group(1)
#
# print(a)


# # x为一个整数
# # 要求随机生成一个6个元素的列表要求列表元素的总和等于x
# import random
#
# def randomNumVaccinePersonTotal(maxValue, num):
#     '''生成总和固定的整数序列
#     maxValue: 序列总和
#     num：要生成的整数个数
#
#     return
#     per_all_persons:list,指定 num个接种点各自待接种的人数
#     '''
#     maxValue = int(maxValue)
#     suiji_ser = random.sample(range(1, maxValue), k=num - 1)  # 在1~maxValue之间，采集20个数据
#     suiji_ser.append(0)  # 加上数据开头
#     suiji_ser.append(maxValue)
#     suiji_ser = sorted(suiji_ser)
#     per_all_persons = [suiji_ser[i] - suiji_ser[i - 1] for i in range(1, len(suiji_ser))]  # 列表推导式，计算列表中每两个数之间的间隔
#
#     return per_all_persons
#
#
# # ---------------------------------------------
# print('测试结果', randomNumVaccinePersonTotal(40, 6))
# import math
#
# num = 3.0000000001# 将要处理的数
# result = math.ceil(num * 10)/10 #向上取整，并保留一位小数
# print('处理后的结果为:', format(result, '.1f'))
# a = "23"
#
# num = 3.0000000001# 将要处理的数
# result = math.ceil(num * 10)/10 #向上取整，并保留一位小数
# print('处理后的结果为:',format(result,'.1f'))


# 定义函数test_del_list_append_loop_reference_cycle()


# def fun(a, b, c):
#     return a+b+c
# test = [1, 2, 3]
# print(fun(*test))
#
#
# def fun(c, b, a):#注意顺序
#     return a == 1 and b == 2 and c == 3
# test = {'a':1, 'b':2, 'c':3}
# print(fun(**test))
# print(fun(*test))
# #
#
# def foobar(param1=None, param4=None):
#     return "{}{}".format(param4, param1)
# values = {"param1": "foo", "param4": "bar"}
# print(foobar(*values))

# numbers = [1, 2, 3, 4, 5, 6]
# # The left side of unpacking should be list or tuple.
# *a, = numbers  # 直接写成*a会提示语法错误
# # print(a)  ## a = [1, 2, 3, 4, 5, 6]
# #
# a, *b, c = numbers
# print(a)  # a = [1, 2, 3, 4, 5]
# print(b)  # b = 6
# print(c)
# #
# a, *b, = numbers
# print(a)  # a = 1
# print(b)  # b = [2, 3, 4, 5, 6]
#
# a, *b, c = numbers
# print(a)  # a = 1
# print(b)  # b = [2, 3, 4, 5]
# print(c)  # c = 6
#
# str1 = 'python'
# s1, *s2, s3 = str1
# print(s1)  # p
# print(s2)  # ['y', 't', 'h', 'o']
# print(s3)  # n
#
# t = ('a', 'b', 'c', 'd', 'e')
# t1, *t2, t3 = t
# print(t1)  # a
# print(t2)  # ['b', 'c', 'd']
# print(t3)

# a = [1, 2, 3]
# b = (4, 5, 6)
# c = {7, 8, 9}
# #  [1, 2, 3, 4, 5, 6, 7, 8, 9]
# print([*a, *b, *c])

# D = {'first': 1, 'second': 2, 'third': 3}
#
# print(*D)
#
# print('{first},{second},{third}'.format(**D))
#
# def log_args_and_kwargs(func):
#
#     def wrapper(*args, **kwargs):
#         print("Arguments:", args)
#         print("Keyword arguments:", kwargs)
#         return func(*args, **kwargs)
#
#     return wrapper
#
#
# @log_args_and_kwargs
# def calculate_sum(a, b):
#     return a + b
#
#
# result = calculate_sum(3, 5)
# print(result)
